aaron-bond.better-comments
adpyke.codesnap
ahmadalli.vscode-nginx-conf
akamud.vscode-theme-onelight
alefragnani.bookmarks
angelo-breuer.clock
asvetliakov.vscode-neovim
benjaminbenais.copilot-theme
bradlc.vscode-tailwindcss
brandonkirbyson.vscode-animations
brapifra.phpserver
christian-kohler.path-intellisense
chrmarti.regex
codezombiech.gitignore
csharpier.csharpier-vscode
cstrap.flask-snippets
danielpinto8zz6.c-cpp-compile-run
davidanson.vscode-markdownlint
donjayamanne.python-environment-manager
dotjoshjohnson.xml
drcika.apc-extension
eamodio.gitlens
ecmel.vscode-html-css
ehabhelaly.summer-night
esbenp.prettier-vscode
felipecaputo.git-project-manager
foxundermoon.shell-format
freakypie.code-python-isort
gamunu.vscode-yarn
github.codespaces
github.copilot
github.copilot-chat
github.copilot-labs
github.remotehub
github.vscode-github-actions
gitlab.gitlab-workflow
hediet.vscode-drawio
idma88.omp-pragma
ionutvmi.path-autocomplete
jaccon.punk-dark-theme
james-yu.latex-workshop
jock.svg
johnpapa.vscode-peacock
josemurilloc.aura-spirit-dracula
kevinrose.vsc-python-indent
kshetline.ligatures-limited
lfm.vscode-makefile-term
mechatroner.rainbow-csv
mervin.markdown-formatter
mhutchie.git-graph
modular-mojotools.vscode-mojo
ms-azuretools.vscode-docker
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
njpwerner.autodocstring
ombratteng.nftables
peterschmalfeldt.explorer-exclude
pkief.material-icon-theme
postman.postman-for-vscode
pranaygp.vscode-css-peek
raynigon.nginx-formatter
redhat.vscode-yaml
ritwickdey.liveserver
rubbersheep.gi
rust-lang.rust-analyzer
simonsiefke.svg-preview
sswg.swift-lang
streetsidesoftware.code-spell-checker
taelid.summer-theme
tomoki1207.pdf
twxs.cmake
uloco.theme-bluloco-light
vadimcn.vscode-lldb
valentjn.vscode-ltex
viktorqvarfordt.vscode-pitch-black-theme
vknabel.vscode-swiftformat
vscode-icons-team.vscode-icons
vscodevim.vim
vsls-contrib.gitdoc
wayou.vscode-todo-highlight
william-voyek.vscode-nginx
xaver.clang-format
xirider.livecode
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
